{
    "attention_probs_dropout_prob": 0.1,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 384,
    "intermediate_size": 1536,
    "initializer_range": 0.02,
    "max_position_embeddings": 2048,
    "num_attention_heads": 12,
    "num_hidden_layers": 6,
    "task_type_vocab_size": 16,
    "type_vocab_size": 4,
    "use_task_id": true,
    "vocab_size": 40000,
    "layer_norm_eps": 1e-05,
    "model_type": "ernie",
    "architectures": [
        "ErnieModel"
    ]
}